# Pandas Tutorial

Pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the python programing language.

* What is data frames?
* what is data series?
* Different operation in pandsa

In [1]:
## importing pandas

import pandas as pd;
import numpy as np;

In [2]:
## playing with dataframe

df = pd.DataFrame(np.arange(0,20).reshape(5,4),index=["row1","row2,","row3","row4","row5"],columns=["col1","col2","col3","col4"])

In [3]:
## accessing the elements

df

       col1  col2  col3  col4
row1      0     1     2     3
row2,     4     5     6     7
row3      8     9    10    11
row4     12    13    14    15
row5     16    17    18    19

In [4]:
#df.to_csv('test.csv')

In [8]:
## Accessing the elements

## 1. .loc  2. .iloc

df.loc['row1']

col1    0
col2    1
col3    2
col4    3
Name: row1, dtype: int32

In [10]:
type(df.loc['row1'])

pandas.core.series.Series

In [11]:
df.iloc[:,:]

       col1  col2  col3  col4
row1      0     1     2     3
row2,     4     5     6     7
row3      8     9    10    11
row4     12    13    14    15
row5     16    17    18    19

In [12]:
df.iloc[0:2,0:2]

       col1  col2
row1      0     1
row2,     4     5

In [13]:
type(df.iloc[:,:])

pandas.core.frame.DataFrame

In [14]:
## converting data frame into array
df.iloc[:,:].values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [15]:
df.iloc[:,:].values.shape

(5, 4)

In [16]:
## cheak how many null values in column
df.isnull().sum()

col1    0
col2    0
col3    0
col4    0
dtype: int64

In [17]:
df["col1"].value_counts()

0     1
4     1
8     1
12    1
16    1
Name: col1, dtype: int64

In [18]:
df["col1"].unique()

array([ 0,  4,  8, 12, 16])

In [19]:
type(df["col2"])

pandas.core.series.Series

In [20]:
df[["col1","col2"]]

       col1  col2
row1      0     1
row2,     4     5
row3      8     9
row4     12    13
row5     16    17